903257958/stm32_oop_driver/st7789_spi_hw_dma/driver/lcd.c
/******************************************************************************
 * @brief	LCD显示单个24x24汉字
 * @param	dev		:	LCDDev_t 结构体指针
 * @param	x		:	x坐标
 * @param	y		:	y坐标
 * @param	Chinese	:	要显示的汉字
 * @param	fc		:	字的颜色
 * @param	bc		:	字的背景色
 * @param	mode	:	模式：0非叠加/1叠加
 * @return	无
 ******************************************************************************/
static void __lcd_show_chinese24x24(LCDDev_t *dev, uint16_t x, uint16_t y, char *Chinese, uint16_t fc, uint16_t bc, uint8_t mode)
{
	uint8_t i, j;
	uint16_t k;
	uint16_t ChineseNum = GetChineseNum(24); 					// 汉字数目
	uint16_t TypefaceNum = (24 / 8 + ((24 % 8) ? 1 : 0)) * 24;	// 一个字符所占字节大小
	uint16_t x0 = x;
	
	for (k = 0; k < ChineseNum; k++)
	{
		if ((LCD_CF24x24[k].Index[0] == *(Chinese)) && (LCD_CF24x24[k].Index[1] == *(Chinese + 1)))
		{
			__lcd_set_windows(dev, x, y, x + 12 - 1, y + 12 - 1);
			for (i = 0; i < TypefaceNum; i++)
			{
				for (j = 0; j < 8; j++)
				{
					if (LCD_CF24x24[k].Msk[i] & (0x01 << j))
						__lcd_draw_point(dev, x, y, fc); // 画一个点
					else if (mode == 0)
						__lcd_draw_point(dev, x, y, bc);
					x++;
					if ((x - x0) == 24)
					{
						x = x0;
						y++;
						break;
					}
				}
			}
		}
		continue; // 查找到对应点阵字库立即退出，防止多个汉字重复取模带来影响
	}
}

/******************************************************************************
 * @brief	LCD显示单个32x32汉字
 * @param	dev		:	LCDDev_t 结构体指针
 * @param	x		:	x坐标
 * @param	y		:	y坐标
 * @param	Chinese	:	要显示的汉字
 * @param	fc		:	字的颜色
 * @param	bc		:	字的背景色
 * @param	mode	:	模式：0非叠加/1叠加
 * @return	无
 ******************************************************************************/
static void __lcd_show_chinese32x32(LCDDev_t *dev, uint16_t x, uint16_t y, char *Chinese, uint16_t fc, uint16_t bc, uint8_t mode)
{
	uint8_t i, j;
	uint16_t k;
	uint16_t ChineseNum = GetChineseNum(32); 					// 汉字数目
	uint16_t TypefaceNum = (32 / 8 + ((32 % 8) ? 1 : 0)) * 32;	// 一个字符所占字节大小
	uint16_t x0 = x;
	
	for (k = 0; k < ChineseNum; k++)
	{
		if ((LCD_CF32x32[k].Index[0] == *(Chinese)) && (LCD_CF32x32[k].Index[1] == *(Chinese + 1)))
		{
			__lcd_set_windows(dev, x, y, x + 12 - 1, y + 12 - 1);
			for (i = 0; i < TypefaceNum; i++)
			{
				for (j = 0; j < 8; j++)
				{
					if (LCD_CF32x32[k].Msk[i] & (0x01 << j))
						__lcd_draw_point(dev, x, y, fc); //画一个点
					else if (mode == 0)
						__lcd_draw_point(dev, x, y, bc);
					x++;
					if ((x - x0) == 32)
					{
						x = x0;
						y++;
						break;
					}
				}
			}
		}
		continue; // 查找到对应点阵字库立即退出，防止多个汉字重复取模带来影响
	}
}

/******************************************************************************
 * @brief	LCD显示汉字串
 * @param	dev		:	LCDDev_t 结构体指针
 * @param	x		:	x坐标
 * @param	y		:	y坐标
 * @param	Chinese	:	要显示的汉字串
 * @param	fc		:	字的颜色
 * @param	bc		:	字的背景色
 * @param	size	:	指定字体大小：LCD_16X32 / LCD_12X24 / LCD_8X16 / LCD_6X12
 * @param	mode	:	模式：0非叠加/1叠加
 * @return	无
 ******************************************************************************/
static void __lcd_show_chinese(LCDDev_t *dev, uint16_t x, uint16_t y, char *Chinese, uint16_t fc, uint16_t bc, uint8_t size, uint8_t mode)
{
	while (*Chinese != 0)
	{
		if (size==LCD_12X12)		__lcd_show_chinese12x12(dev, x, y, Chinese, fc, bc, mode);
		else if (size==LCD_16X16)	__lcd_show_chinese16x16(dev, x, y, Chinese, fc, bc, mode);
		else if (size==LCD_24X24)	__lcd_show_chinese24x24(dev, x, y, Chinese, fc, bc, mode);
		else if (size==LCD_32X32)	__lcd_show_chinese32x32(dev, x, y, Chinese, fc, bc, mode);
		else return;
		
		Chinese += LCD_CHN_CHAR_WIDTH;
		x += size;
	}
}

/******************************************************************************
 * @brief	LCD显示图片
 * @param	dev		:	LCDDev_t 结构体指针
 * @param	x		:	图片左上角x坐标
 * @param	y		:	图片左上角y坐标
 * @param	width	:	图片宽度
 * @param	height	:	图片高度
 * @param	pic[]	:	图片数组
 * @return	无
 ******************************************************************************/
static void __lcd_show_image(LCDDev_t *dev, uint16_t x, uint16_t y, uint16_t width, uint16_t height, const uint8_t pic[])
{
	uint16_t i, j; 
	uint32_t k = 0;

	__lcd_set_windows(dev, x, y, x + width - 1, y + height - 1);	// 设置显示范围
	for (i = 0; i < height; i++)
	{													   	 	
		for (j = 0; j < width; j++)
		{
			__lcd_write_byte(dev, pic[k * 2]);
			__lcd_write_byte(dev, pic[k * 2 + 1]);
			k++;
		}
	}
}

/******************************************************************************
 * @brief	LCD画点
 * @param	dev		:  LCDDev_t 结构体指针
 * @param	x		:  x坐标
 * @param	y		:  y坐标
 * @param	color	:  颜色
 * @return	无
 ******************************************************************************/
static void __lcd_draw_point(LCDDev_t *dev, uint16_t x, uint16_t y, uint16_t color)
{
	__lcd_set_windows(dev, x, y, x, y);		// 设置光标位置 
	__lcd_write_halfword(dev, color);
}

/******************************************************************************
 * @brief	LCD画线
 * @param	dev		:  LCDDev_t 结构体指针
 * @param	x1		:  起始x坐标
 * @param	y1		:  起始y坐标
 * @param	x2		:  终点x坐标
 * @param	y2		:  终点y坐标
 * @param	color	:  颜色
 * @return	无
 ******************************************************************************/
static void __lcd_draw_line(LCDDev_t *dev, uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2, uint16_t color)
{
    uint16_t t;
    int xerr = 0, yerr = 0, delta_x, delta_y, distance;
    int incx, incy, uRow, uCol;
    delta_x = x2 - x1;              // 计算坐标增量
    delta_y = y2 - y1;
    uRow = x1;
    uCol = y1;

    if (delta_x > 0)incx = 1;       // 设置单步方向
    else if (delta_x == 0)incx = 0; // 垂直线
    else
    {
        incx = -1;
        delta_x = -delta_x;
    }

    if (delta_y > 0)incy = 1;
    else if (delta_y == 0)incy = 0; // 水平线
    else
    {
        incy = -1;
        delta_y = -delta_y;
    }

    if ( delta_x > delta_y)distance = delta_x; // 选取基本增量坐标轴
    else distance = delta_y;

    for (t = 0; t <= distance + 1; t++ )    // 画线输出
    {
        __lcd_draw_point(dev, uRow, uCol, color); // 画点
        xerr += delta_x ;
        yerr += delta_y ;

        if (xerr > distance)
        {
            xerr -= distance;
            uRow += incx;
        }

        if (yerr > distance)
        {
            yerr -= distance;
            uCol += incy;
        }
    }
}

