903257958/stm32_oop_driver/st7789_spi_hw_dma/driver/lcd.c
/******************************************************************************
 * @brief	LCD画矩形
 * @param	dev		:  LCDDev_t 结构体指针
 * @param	x		:  矩形左上角x坐标
 * @param	y		:  矩形左上角y坐标
 * @param	width	:  矩形宽度
 * @param	height	:  矩形高度
 * @param	color	:  颜色
 * @return	无
 ******************************************************************************/
static void __lcd_draw_rectangle(LCDDev_t *dev, uint16_t x, uint16_t y, uint16_t width, uint16_t height, uint16_t color)
{
	uint16_t x_end = x + width - 1;
    uint16_t y_end = y + height - 1;

	__lcd_draw_line(dev, x, y, x_end, y, color);
	__lcd_draw_line(dev, x, y, x, y_end, color);
	__lcd_draw_line(dev, x, y_end, x_end, y_end, color);
	__lcd_draw_line(dev, x_end, y, x_end, y_end, color);
}

/******************************************************************************
 * @brief	LCD画圆
 * @param	dev		:	LCDDev_t 结构体指针
 * @param	x,y		:	圆心坐标
 * @param	radius	:	半径
 * @param	color	:	圆的颜色
 * @return	无
 ******************************************************************************/
static void __lcd_draw_circle(LCDDev_t *dev, uint16_t x, uint16_t y, uint8_t radius, uint16_t color)
{
	int a, b;
	a = 0;
	b = radius;
	
	while (a <= b)
	{
		__lcd_draw_point(dev, x - b, y - a, color);	// 3           
		__lcd_draw_point(dev, x + b, y - a, color);	// 0           
		__lcd_draw_point(dev, x - a, y + b, color);	// 1                
		__lcd_draw_point(dev, x - a, y - b, color);	// 2             
		__lcd_draw_point(dev, x + b, y + a, color);	// 4               
		__lcd_draw_point(dev, x + a, y - b, color);	// 5
		__lcd_draw_point(dev, x + a, y + b, color);	// 6 
		__lcd_draw_point(dev, x - b, y + a, color);	// 7
		a++;
		if ((a * a + b * b) > (radius * radius))		// 判断要画的点是否过远
		{
			b--;
		}
	}
}

/******************************************************************************
 * @brief	去初始化LCD
 * @param	dev   :  OLEDDev_t结构体指针
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __lcd_deinit(LCDDev_t *dev)
{
	if (!dev || !dev->init_flag)
	return -1;
	
	LCDPrivData_t *priv_data = (LCDPrivData_t *)dev->priv_data;
	
	/* 去初始化硬件SPI */
	priv_data->spi.deinit(&priv_data->spi);

	/* 去初始化PWM */
	priv_data->pwm.deinit(&priv_data->pwm);
	
	/* 释放私有数据内存 */
	free(dev->priv_data);
	dev->priv_data = NULL;
	
	dev->init_flag = false;	// 修改初始化标志
	return 0;
}

/**********************************************************************功能函数*/
